{
  "base_model_name_or_path": "vilsonrodrigues/falcon-7b-instruct-sharded",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 64,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 32,
  "revision": null,
  "target_modules": [
    "q_proj",
    "v_proj",
    "query_key_value"
  ],
  "task_type": "CAUSAL_LM"
}